In [8]:
import numpy as np

In [9]:
import pandas as pd

In [ ]:
a=[1,2,3,4,5]
name=["태조","정종","태조","세종","문종"]
life=[73,62,55,53,58]

In [6]:
vars = {'id' : [1, 2, 3, 4, 5],
        'name' : ['태조', '정종', '태조', '세종', '문종'],
        'life' : [73, 62, 55, 53, 38]
        }

In [10]:
data_king = pd.DataFrame(vars, columns = ['id', 'name', 'life'])

In [12]:
data_king

   id name  life
0   1   태조    73
1   2   정종    62
2   3   태조    55
3   4   세종    53
4   5   문종    38

In [17]:
dataset=pd.read_csv('buy.csv')
dataset

      id  year  buy  age  edu  income   exp    co     ad   prod
0      1  2013    1    5    3   17600  8800   9.3  11.36   5.01
1      2  2013    0    4    2    2500  2300  10.2   0.39    NaN
2      3  2013    0    3    1    6700  5400  30.6   3.83  16.67
3      4  2013    1    2    1    1900  1200  24.4   1.36   3.28
4      5  2013    0    3    1    2500  1900  19.7   2.78   2.15
..   ...   ...  ...  ...  ...     ...   ...   ...    ...    ...
695  696  2015    0    2    3    2000  1000   4.7   0.22   0.72
696  697  2015    0    4    2    6600  5500  12.1   2.32   5.67
697  698  2015    1    3    2    2700  1400   4.6   0.26   0.98
698  699  2015    0    4    1    7700  3200   8.4   2.30   4.17
699  700  2015    0    3    1    4400  3600  14.7   2.99   3.47

[700 rows x 10 columns]

In [28]:
np.corrcoef(dataset['income'], dataset['ad'])

array([[1.        , 0.56583209],
       [0.56583209, 1.        ]])

In [85]:
vars1 = {'id' : [NA, NA, NA, 4, 5],
        'name' : ['태조', NA, '태조', '세종', '문종'],
        'life' : [73, NA, 55, 53, 38]
        }

In [86]:
data_king1 = pd.DataFrame(vars1, columns = ['id', 'name', 'life'])

In [87]:
data_king1

    id name  life
0  NaN   태조  73.0
1  NaN  NaN   NaN
2  NaN   태조  55.0
3  4.0   세종  53.0
4  5.0   문종  38.0

In [76]:
data_king1.dropna()

    id name  life
3  4.0   세종    53
4  5.0   문종    38

In [68]:
data_king1['id'].fillna(data_king1['id'].mean())

0    4.5
1    4.5
2    4.5
3    4.0
4    5.0
Name: id, dtype: float64

In [70]:
from numpy import nan as NA

In [88]:
data_king1.dropna(thresh = 1)

    id name  life
0  NaN   태조  73.0
2  NaN   태조  55.0
3  4.0   세종  53.0
4  5.0   문종  38.0

In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [184]:
dataset=pd.read_csv('buy.csv')
dataset

      id  year  buy  age  edu  income   exp    co     ad   prod
0      1  2013    1    5    3   17600  8800   9.3  11.36   5.01
1      2  2013    0    4    2    2500  2300  10.2   0.39    NaN
2      3  2013    0    3    1    6700  5400  30.6   3.83  16.67
3      4  2013    1    2    1    1900  1200  24.4   1.36   3.28
4      5  2013    0    3    1    2500  1900  19.7   2.78   2.15
..   ...   ...  ...  ...  ...     ...   ...   ...    ...    ...
695  696  2015    0    2    3    2000  1000   4.7   0.22   0.72
696  697  2015    0    4    2    6600  5500  12.1   2.32   5.67
697  698  2015    1    3    2    2700  1400   4.6   0.26   0.98
698  699  2015    0    4    1    7700  3200   8.4   2.30   4.17
699  700  2015    0    3    1    4400  3600  14.7   2.99   3.47

[700 rows x 10 columns]

In [120]:
l=(dataset.year==2013)&(dataset.buy==1) | (dataset.year==2014)&(dataset.buy==1)

0       True
1      False
2      False
3       True
4      False
       ...
695    False
696    False
697    False
698    False
699    False
Length: 700, dtype: bool

In [121]:
dataset.loc[l,['year','age','edu','income','exp']]

     year  age  edu  income   exp
0    2013    5    3   17600  8800
3    2013    2    1    1900  1200
6    2013    3    2    4100  4100
16   2013    2    2    3100  2600
23   2013    2    2    3600  2000
..    ...  ...  ...     ...   ...
463  2014    2    1    2100  1400
464  2014    3    1    4100  3600
468  2014    2    3    2000  2000
475  2014    2    1    1400  1200
477  2014    3    1    3300  2600

[125 rows x 5 columns]

In [122]:
dataset=pd.read_csv('buy.csv')
dataset

      id  year  buy  age  edu  income   exp    co     ad   prod
0      1  2013    1    5    3   17600  8800   9.3  11.36   5.01
1      2  2013    0    4    2    2500  2300  10.2   0.39    NaN
2      3  2013    0    3    1    6700  5400  30.6   3.83  16.67
3      4  2013    1    2    1    1900  1200  24.4   1.36   3.28
4      5  2013    0    3    1    2500  1900  19.7   2.78   2.15
..   ...   ...  ...  ...  ...     ...   ...   ...    ...    ...
695  696  2015    0    2    3    2000  1000   4.7   0.22   0.72
696  697  2015    0    4    2    6600  5500  12.1   2.32   5.67
697  698  2015    1    3    2    2700  1400   4.6   0.26   0.98
698  699  2015    0    4    1    7700  3200   8.4   2.30   4.17
699  700  2015    0    3    1    4400  3600  14.7   2.99   3.47

[700 rows x 10 columns]

In [123]:
k=(dataset.year==2015) &(dataset.co>10)

In [124]:
dataset[k]

      id  year  buy  age  edu  income   exp    co    ad  prod
488  489  2015    0    2    4    3200  2700  17.6  2.14  3.49
490  491  2015    0    2    1    2700  1300  14.4  1.02  2.87
491  492  2015    0    2    2    4500  5600  26.0  6.05  5.65
493  494  2015    0    4    1    2600  2100  10.4  0.12  2.58
494  495  2015    1    2    2    2100  2200  11.4  0.78  1.62
..   ...   ...  ...  ...  ...     ...   ...   ...   ...   ...
692  693  2015    0    5    1    5300  3100  10.5  0.84  4.72
693  694  2015    1    3    1    3900  3100  16.1  1.70  4.58
694  695  2015    0    3    1    6800  5900  10.8  1.37  5.98
696  697  2015    0    4    2    6600  5500  12.1  2.32  5.67
699  700  2015    0    3    1    4400  3600  14.7  2.99  3.47

[98 rows x 10 columns]

In [126]:
dataset[k].groupby("age").mean()

,id,year,buy,edu,income,exp,co,ad,prod
age,,,,,,,,,
2,578.692308,2015.0,0.461538,1.961538,2542.307692,2080.769231,17.023077,1.488846,2.881923
3,607.605263,2015.0,0.315789,1.815789,3992.105263,2952.631579,16.563158,2.239737,4.417895
4,597.357143,2015.0,0.285714,1.964286,6710.714286,4707.142857,14.796429,2.934643,6.806786
5,601.166667,2015.0,0.500000,1.333333,5266.666667,3550.000000,11.983333,2.376667,4.135000

In [130]:
import math

In [139]:
dataset.sample(n=420).groupby("age").mean()

,id,year,buy,edu,income,exp,co,ad,prod
age,,,,,,,,,
2,342.896000,2013.984000,0.368000,1.664000,2599.200000,1936.800000,10.378400,0.870240,1.694000
3,359.234177,2014.012658,0.221519,1.702532,4052.531646,3017.088608,10.929114,1.567532,2.894494
4,378.747368,2014.073684,0.178947,1.715789,6140.000000,4657.894737,10.257895,1.874632,4.237895
5,338.547619,2013.880952,0.214286,1.690476,6388.095238,4576.190476,10.259524,2.266905,4.228095

In [140]:
dataset.sample(n=210).groupby("age").mean()

,id,year,buy,edu,income,exp,co,ad,prod
age,,,,,,,,,
2,368.800000,2014.046154,0.384615,1.676923,2673.846154,1924.615385,10.587692,0.972615,1.760923
3,348.974026,2013.974026,0.181818,1.610390,4129.870130,3038.961039,10.271429,1.603636,2.720779
4,366.380000,2014.020000,0.120000,1.920000,7938.000000,5838.000000,8.772000,1.955200,4.480612
5,310.333333,2013.888889,0.388889,1.500000,5433.333333,4483.333333,11.533333,2.278889,4.425000

In [141]:
dataset.sample(n=70).groupby("age").mean()

,id,year,buy,edu,income,exp,co,ad,prod
age,,,,,,,,,
2,324.045455,2013.954545,0.363636,1.636364,2918.181818,2204.545455,11.959091,1.088636,2.030909
3,341.920000,2013.960000,0.200000,1.800000,3892.000000,2968.000000,11.436000,1.390800,2.975600
4,364.571429,2014.000000,0.142857,1.857143,4778.571429,3521.428571,8.314286,1.487143,2.487857
5,305.777778,2013.888889,0.333333,1.777778,6377.777778,4255.555556,10.755556,1.386667,4.468889

In [142]:
from sklearn.linear_model import LogisticRegression

In [145]:
model = LogisticRegression()
model.fit(buy, income)

NameError: name 'buy' is not defined

In [166]:
from sklearn.model_selection import train_test_split

# train, test 셋 분리
X = dataset[['id', 'year', 'edu', 'income','exp']]
y = dataset['buy']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2)

In [167]:
model = LogisticRegression(penalty = 'l2')
model.fit(X_train, y_train)

LogisticRegression()

In [168]:
from sklearn.linear_model import LogisticRegression

In [169]:
from sklearn.metrics import accuracy_score

In [170]:
y_pred = model.predict(X_test)

In [171]:
accuracy_score(y_pred, y_test)

0.7357142857142858

In [175]:
dataset.loc[dataset['age']<=3, 'age_gp'] = 'Young'

In [177]:
dataset.loc[dataset['age']>3, 'age_gp'] =  'Old'

In [180]:
import statsmodels.api as sm

In [191]:
from scipy import stats

In [198]:
a0 = dataset.income[dataset.age>=5]
a1 = dataset.income[dataset.age<5]

stats.ttest_ind(a0, a1)

Ttest_indResult(statistic=4.446670871999104, pvalue=1.0144219631808185e-05)

In [193]:
dataset

      id  year  buy  age  edu  income   exp    co     ad   prod
0      1  2013    1    5    3   17600  8800   9.3  11.36   5.01
1      2  2013    0    4    2    2500  2300  10.2   0.39    NaN
2      3  2013    0    3    1    6700  5400  30.6   3.83  16.67
3      4  2013    1    2    1    1900  1200  24.4   1.36   3.28
4      5  2013    0    3    1    2500  1900  19.7   2.78   2.15
..   ...   ...  ...  ...  ...     ...   ...   ...    ...    ...
695  696  2015    0    2    3    2000  1000   4.7   0.22   0.72
696  697  2015    0    4    2    6600  5500  12.1   2.32   5.67
697  698  2015    1    3    2    2700  1400   4.6   0.26   0.98
698  699  2015    0    4    1    7700  3200   8.4   2.30   4.17
699  700  2015    0    3    1    4400  3600  14.7   2.99   3.47

[700 rows x 10 columns]